namespace JT808.Protocol.Extensions.JT1078.Enums
{
#pragma warning disable CS1591 // 缺少对公共可见类型或成员的 XML 注释
    public enum JT808_JT1078_MsgId:ushort

    {
        终端上传音视频属性 = 0x1003,
        终端上传乘客流量 = 0x1005,
        终端上传音视频资源列表 = 0x1205,
        文件上传完成通知 = 0x1206,
        查询终端音视频属性 = 0x9003,
        实时音视频传输请求 = 0x9101,
        音视频实时传输控制 = 0x9102,
        实时音视频传输状态通知 = 0x9105,
        平台下发远程录像回放请求 = 0x9201,
        平台下发远程录像回放控制 = 0x9202,
        查询资源列表 = 0x9205,
        文件上传指令 = 0x9206,
        文件上传控制 = 0x9207,
        云台旋转 = 0x9301,
        云台调整焦距控制 = 0x9302,
        云台调整光圈控制 = 0x9303,
        云台雨刷控制 = 0x9304,
        红外补光控制 = 0x9305,
        云台变倍控制 = 0x9306
    }
    #pragma warning restore CS1591 // 缺少对公共可见类型或成员的 XML 注释
}
